app/views/wishlist/index.html.erb

        <% @items.each do |item| %>
          <div class="col-md-3 col-sm-4 col-xs-6 col-xlg-2 search-item categories <%= item.category.split(" ").join %>">
---
SELECT "categories".* FROM "categories"