app/controllers/cellar_controller.rb

SELECT "items".* FROM "items"
SELECT "categories".* FROM "categories"
---
  def index
    @items = Item.all
    @categories = Category.all