app/controllers/wishlist_controller.rb

  def index
    @items = Item.all
    @categories = Category.all
---
SELECT "items".* FROM "items"
SELECT "categories".* FROM "categories"